////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************/
// BaseArmor 
// базовая броня определяющаяся только кол-вом HP юнита
//
/**********************************************************************************/
class BaseArmor : IArmor
{
    // эвент сообщающий о смерти юнита
    public event DestructionEvent UnitIsDown;

    protected int m_unitHP;

    /**********************************************************************************/
    // функция установки количества здоровья
    //
    /**********************************************************************************/
    public void SetHealth(int health)
    {
        m_unitHP = health;
    }

    /**********************************************************************************/
    // функция нанесения урона юниту
    //
    /**********************************************************************************/
    public virtual void TakeDamage(DamageData damage)
    {
        m_unitHP -= damage.Damage;

        // если юнит повержен
        if(m_unitHP <= 0)
        {
            m_unitHP = 0;

            // извещаем всех о смерти юнита
            if(UnitIsDown != null)
            {
                UnitIsDown(damage);
            }
        }
    }

    /**********************************************************************************/
    // процессинговая функция
    // базовая броня не обладает свойствами зависящими от игрового времени
    //
    /**********************************************************************************/
    public virtual void Update()
    {
        // do nothing
    }

    /**********************************************************************************/
    // сброс состояний и настроек
    // не используется в данной реализации
    //
    /**********************************************************************************/
    public void ResetComponent()
    {
        // do nothing
    }
}

