using UnityEngine;
using System.Collections;

/**********************************************************************************/
// LaserWeaponCtr класс
// контроллер лазерного оружия
/**********************************************************************************/
[System.Serializable]
public class LaserWeaponCtr : ClassicWeaponCtr
{
    private LaserCtr m_ctr;

    /**********************************************************************************/
    // LaserWeaponCtr конструктор
    //
    /**********************************************************************************/
    public LaserWeaponCtr(int ownerID, LaserCtr ctr) :
        base(ownerID)
    {
        m_currentAmmo = NumberOfBullet;
        m_ctr = ctr;
    }

    /**********************************************************************************/
    // сеттер для LaserCtr
    //
    /**********************************************************************************/
    public void SetLaserCtr(LaserCtr ctr)
    {
        m_ctr = ctr;
    }

    /**********************************************************************************/
    // передаём контроллеру лазера объект носителя
    //
    /**********************************************************************************/
    public void SetOwnerObject(GameObject obj)
    {
        m_ctr.SetOwnerObject(obj);
    }

    /**********************************************************************************/
    // Создаём луч лазера
    //
    /**********************************************************************************/
    protected override void CreateBullet(Vector2 position, Base.DIREC direction)
    {
        m_ctr.Fire(position, direction);
    }

    /**********************************************************************************/
    // Выключаем лазер
    //
    /**********************************************************************************/
    public override void StopFire()
    {
        // состояние READY и StopFire означает, что игрок отпустил/не нажимал кнопку стрельбы
        // состояние EMPTY означает, что мы не можем вести стрельбу
        if (m_state == WEAPON_STATE.READY || m_state == WEAPON_STATE.EMPTY)
        {
            m_ctr.DisableLaser();
        }
    }

}
