using UnityEngine;
using UnityEditor;

/**********************************************************************************/
// EnergyStationCtr класс
// контроллер электростанции, не захватываемо, производит бонус
//
/**********************************************************************************/
public class EnergyStationCtr : BuildingController
{
    /**********************************************************************************/
    // функция инициализации (Unity)
    //
    /**********************************************************************************/
    new void Start()
    {
        base.Start();
    }

    /**********************************************************************************/
    // функция захвата строения
    // Конкретно это здание незахватываемо!
    //
    /**********************************************************************************/
    public override void Capture(CaptureData cdata)
    {
        // ничего не делаем, здание не захватываемо
    }
}