using UnityEngine;
using System.Collections;
////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************/
/**********************************************************************************/
/**********************************************************************************/
// DogBoss класс
// контроллер боса собаки
// его могли бы звать и Бим, но нет же - просто Шарик
//
/**********************************************************************************/
public class DogBoss : IshekoidCtr
{
    /**********************************************************************************/
    // обработчик смерти
    //
    /**********************************************************************************/
    protected override void OnDead(DamageData finalStrikeData)
    {
        TargetController.GetInstance().TargetIsDead(gameObject);
        base.OnDead(finalStrikeData);
    }
}
