using UnityEngine;
using UnityEditor;

////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************/
/**********************************************************************************/
/**********************************************************************************/
// MugikCtr класс
// контроллер лучшего среди деревенских мужиков
// бродит, стреляет по врагам, здоровый как бык и почти не пьёт
// если бы не характер - был бы первым женихом
//
/**********************************************************************************/
public class MugikBossCtr : MugikCtr
{
    /**********************************************************************************/
    // обработчик смерти
    //
    /**********************************************************************************/
    protected override void OnDead(DamageData finalStrikeData)
    {
        TargetController.GetInstance().TargetIsDead(gameObject);
        base.OnDead(finalStrikeData);
    }
}