////////////////////////////////////////////////////////////////////////////////////
/**********************************************************************************/
// PredatorDrive
// движетель определяющий поведение юнита-хищника
// при наличии цели, юнит преследует её, в противном случае бродит
//
/**********************************************************************************/
using UnityEngine;

class PredatorDrive : WanderingDrive
{
    protected float m_speedMultiplier = 1.0f;

    /**********************************************************************************/
    // конструктор
    //
    /**********************************************************************************/
    public PredatorDrive(Unit unitToDrive)
        : base(unitToDrive)
    {
    }

    /**********************************************************************************/
    // основная процессинговая функция движетеля, здесь мы перемещаем юнита
    //
    /**********************************************************************************/
    public override void Update()
    {
        if (!m_driveIsPaused)
        {
            if(m_target != null)
            {
                MoveToGObject(m_target);
            }
            else
            {
                MoveToRandomeBlock();
            }
            UpdateGamePosition();
        }

        UpdateTimers();
    }

    /**********************************************************************************/
    // устанавливаем коэффициент ускорения
    //
    /**********************************************************************************/
    public void SetSpeedMultiplier(float multiplier)
    {
        m_speedMultiplier = multiplier;
    }

    /**********************************************************************************/
    // функция устанавливает цель для приследования
    //
    /**********************************************************************************/
    public override void SetTargetToMove(GameObject target)
    {
        // если цели не было, но мы её нашли - ускоряемся
        if(target != null && m_target == null)
        {
            m_unitToDrive.speedMultiplier += m_speedMultiplier;
        }
        // если цель была, но мы её потеряли - возвращаемся к базовым показателям
        else if (target == null && m_target != null)
        {
            m_unitToDrive.speedMultiplier -= m_speedMultiplier;
        }

        base.SetTargetToMove(target);
    }
}

